gogia_palmeri/velocity/v0.05/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;	//1

vertices
(
    (-0.52 -0.26 0)
    (1.3 -0.26 0)
    (1.3 0.26 0)
    (-0.52 0.26 0)
    (-0.52 -0.26 0.52)
    (1.3 -0.26 0.52)
    (1.3 0.26 0.52)
    (-0.52 0.26 0.52)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (196 56 56) simpleGrading (1 1 1)  //(180 120 80)
);

edges
(
);

boundary
(
    inlet // atmosphere
    {
        type patch;  //patch
        faces
        (
         
          (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (        
          (1 2 6 5)
        );
    }
    leftRightTop
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
            (4 5 6 7)
        );
    }
    Bottom
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
);
 

// ************************************************************************* //
